# PYTHON PANDAS PART 3

## Descriptive Statistics

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame([[2.4,np.nan],[6.3,5.4],[np.nan,np.nan],[0.75,1.3]],
                  index = ["a","b","c","d"],
                  columns = ["one","two"])
print(df)
print(df.sum()) # columns sum
print(df.sum(axis = "columns")) # rows sum

    one  two
a  2.40  NaN
b  6.30  5.4
c   NaN  NaN
d  0.75  1.3
one    9.45
two    6.70
dtype: float64
a     2.40
b    11.70
c     0.00
d     2.05
dtype: float64

In [3]:
print(df.mean()) # columns mean
print(df.mean(axis = "columns")) # rows mean
print(df.mean(axis = "columns", skipna = False)) # nan value added mean and if data has nan value, mean do not calculate

one    3.15
two    3.35
dtype: float64
a    2.400
b    5.850
c      NaN
d    1.025
dtype: float64
a      NaN
b    5.850
c      NaN
d    1.025
dtype: float64

In [4]:
print(df.idxmax()) # columns max index
print(df.idxmax( axis = "columns")) # rows max index
print(df.idxmin()) # columns min index
print(df.idxmin( axis = "columns")) # rows min index

one    b
two    b
dtype: object
a    one
b    one
c    NaN
d    two
dtype: object
one    d
two    d
dtype: object
a    one
b    two
c    NaN
d    one
dtype: object

In [5]:
print(df.cumsum()) # columns cumulative value
print(df.cumsum(axis="columns")) # rowx cumulative value

    one  two
a  2.40  NaN
b  8.70  5.4
c   NaN  NaN
d  9.45  6.7
    one    two
a  2.40    NaN
b  6.30  11.70
c   NaN    NaN
d  0.75   2.05

In [6]:
df.describe()

         one       two
count  3.000  2.000000
mean   3.150  3.350000
std    2.850  2.899138
min    0.750  1.300000
25%    1.575  2.325000
50%    2.400  3.350000
75%    4.350  4.375000
max    6.300  5.400000

## Correlation

In [10]:
iris = pd.read_csv("C:\\Users\\erdem\\Desktop\\Data 101\\Pandas 101\\iris.csv", encoding="utf-8") 
#data sets = https://www.kaggle.com/datasets/uciml/iris
iris

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [11]:
iris["SepalLengthCm"].corr(iris["SepalWidthCm"])

-0.10936924995064937

In [12]:
iris["PetalLengthCm"].corr(iris["PetalWidthCm"])

0.9627570970509663

In [13]:
iris.corr()

C:\Users\erdem\AppData\Local\Temp\ipykernel_3552\2141086772.py:1: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  iris.corr()

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm
Id,1.000000,0.716676,-0.397729,0.882747,0.899759
SepalLengthCm,0.716676,1.000000,-0.109369,0.871754,0.817954
SepalWidthCm,-0.397729,-0.109369,1.000000,-0.420516,-0.356544
PetalLengthCm,0.882747,0.871754,-0.420516,1.000000,0.962757
PetalWidthCm,0.899759,0.817954,-0.356544,0.962757,1.000000

In [14]:
iris.cov() # covariance

C:\Users\erdem\AppData\Local\Temp\ipykernel_3552\2160233148.py:1: FutureWarning: The default value of numeric_only in DataFrame.cov is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  iris.cov()

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm
Id,1887.500000,25.782886,-7.492282,67.667785,29.832215
SepalLengthCm,25.782886,0.685694,-0.039268,1.273682,0.516904
SepalWidthCm,-7.492282,-0.039268,0.188004,-0.321713,-0.117981
PetalLengthCm,67.667785,1.273682,-0.321713,3.113179,1.296387
PetalWidthCm,29.832215,0.516904,-0.117981,1.296387,0.582414

In [15]:
iris.corrwith(iris.PetalLengthCm)

C:\Users\erdem\AppData\Local\Temp\ipykernel_3552\1483790318.py:1: FutureWarning: The default value of numeric_only in DataFrame.corrwith is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  iris.corrwith(iris.PetalLengthCm)

Id               0.882747
SepalLengthCm    0.871754
SepalWidthCm    -0.420516
PetalLengthCm    1.000000
PetalWidthCm     0.962757
dtype: float64

In [17]:
s = pd.Series(["b","b","b","b","c","c","a","a","a"])
print(s)
print(s.unique())
print(s.value_counts())

0    b
1    b
2    b
3    b
4    c
5    c
6    a
7    a
8    a
dtype: object
['b' 'c' 'a']
b    4
a    3
c    2
dtype: int64

In [18]:
x = s.isin(["b","c"])
x

0     True
1     True
2     True
3     True
4     True
5     True
6    False
7    False
8    False
dtype: bool

In [19]:
s[x]

0    b
1    b
2    b
3    b
4    c
5    c
dtype: object

## Data Read and Write

In [23]:
df = pd.read_table("C:\\Users\\erdem\\Desktop\\Data 101\\Pandas 101\\data1.txt", sep = " ")
df

     name  points sex
0     joe      56   m
1   Erdem     100   m
2  angela      86   f
3   lucia      94   f
4    jack      72   m

In [26]:
df1 = pd.read_table("C:\\Users\\erdem\\Desktop\\Data 101\\Pandas 101\\data2.txt", sep = " ", header= None)
df1 # when there is no header in the data

        0    1  2
0     joe   56  m
1   Erdem  100  m
2  angela   86  f
3   lucia   94  f
4    jack   72  m

In [32]:
df2 = pd.read_table("C:\\Users\\erdem\\Desktop\\Data 101\\Pandas 101\\data1.txt",
                    sep = " ", 
                    header= None, 
                    names = ["name","points","sex"], # col names
                    index_col= "name") # indes
df2

        points  sex
name
name    points  sex
joe         56    m
Erdem      100    m
angela      86    f
lucia       94    f
jack        72    m

In [34]:
df3 = pd.read_table("C:\\Users\\erdem\\Desktop\\Data 101\\Pandas 101\\data3.txt",
                    sep = " ",
                    index_col = ["lesson","name"])
df3

               one  two
lesson name
Mat    joe      56   88
       Erdem   100  100
       angela   86   42
       lucia    94   87
Bio    jack     72   78
       joe      56   23
       Erdem   100  100

In [35]:
df4 = pd.read_table("C:\\Users\\erdem\\Desktop\\Data 101\\Pandas 101\\data4.txt",
                    sep = " ")
df4

          #hello world
name      points   sex
#Student  points   NaN
joe           56     m
Erdem        100     m
angela        86     f
lucia         94     f
jack          72     m

In [36]:
df4 = pd.read_table("C:\\Users\\erdem\\Desktop\\Data 101\\Pandas 101\\data4.txt",
                    sep = " ",
                    skiprows=[0,2])
df4

     name  points sex
0     joe      56   m
1   Erdem     100   m
2  angela      86   f
3   lucia      94   f
4    jack      72   m

In [37]:
df4 = pd.read_table("C:\\Users\\erdem\\Desktop\\Data 101\\Pandas 101\\data4.txt",
                    sep = " ",
                    skiprows=[0,2],
                    usecols=[0,1])
df4

     name  points
0     joe      56
1   Erdem     100
2  angela      86
3   lucia      94
4    jack      72

In [41]:
df5 = pd.read_table("C:\\Users\\erdem\\Desktop\\Data 101\\Pandas 101\\data5.txt",
                    sep = ",")
df5

     name  points    sex
0     joe    56.0    NaN
1   Erdem     NaN  Erdem
2  angela    86.0    n.a
3     NaN    94.0      f
4    jack    -6.0      m

In [42]:
pd.isnull(df5)

    name  points    sex
0  False   False   True
1  False    True  False
2  False   False  False
3   True   False  False
4  False   False  False

In [43]:
df5 = pd.read_table("C:\\Users\\erdem\\Desktop\\Data 101\\Pandas 101\\data5.txt",
                    sep = ",",
                    na_values=["n.a",-6])
df5

     name  points    sex
0     joe    56.0    NaN
1   Erdem     NaN  Erdem
2  angela    86.0    NaN
3     NaN    94.0      f
4    jack     NaN      m

In [45]:
null_val = {"points":[-6],
            "sex":["n.a","Erdem"]}
df5 = pd.read_table("C:\\Users\\erdem\\Desktop\\Data 101\\Pandas 101\\data5.txt",
                    sep = ",",
                    na_values=null_val)
df5

     name  points  sex
0     joe    56.0  NaN
1   Erdem     NaN  NaN
2  angela    86.0  NaN
3     NaN    94.0    f
4    jack     NaN    m

In [46]:
df = pd.read_table("C:\\Users\\erdem\\Desktop\\Data 101\\Pandas 101\\data1.txt", sep = " ")
df

     name  points sex
0     joe      56   m
1   Erdem     100   m
2  angela      86   f
3   lucia      94   f
4    jack      72   m

In [48]:
df.to_csv("C:\\Users\\erdem\\Desktop\\Data 101\\Pandas 101\\new_data.csv")

In [49]:
import sys
df.to_csv(sys.stdout,sep="|")

|name|points|sex
0|joe|56|m
1|Erdem|100|m
2|angela|86|f
3|lucia|94|f
4|jack|72|m

In [51]:
df.to_csv(sys.stdout,sep="|",
          na_rep = "NULL", # na value -> write NULL
          index = False,
          header = False,
          columns = ["name","sex"])

joe|m
Erdem|m
angela|f
lucia|f
jack|m

####    read_csv():
####    Reads a comma-separated text file (in CSV format) and creates a DataFrame.
####    
####    read_excel():
####    Reads an Excel file (in XLS or XLSX format) and creates a DataFrame.
####    
####    read_sql():
####    Reads the result of an SQL query or table and creates a DataFrame.
####    
####    read_json():
####    Reads a file or array in JSON format and creates a DataFrame.
####    
####    read_html():
####    Reads HTML tables and creates one or more DataFrames.
####    
####    read_table():
####    Reads a text file separated by a specified delimiter (default is tab) and creates a DataFrame.
####    
####    read_clipboard():
####    Reads text from the clipboard and creates a DataFrame. Often used for quick data copying.
####    
####    read_feather():
####    Reads a file in Feather format and creates a DataFrame (a fast and uncompressed format).
####    
####    read_parquet():
####    Reads a file in Parquet format and creates a DataFrame (optimized for data compression and performance).
####    
####    read_orc():
####    Reads a file in ORC (Optimized Row Columnar) format and creates a DataFrame.
####    
####    read_stata():
####    Reads files used by Stata software (in DTA format) and creates a DataFrame.
####    
####    read_sas():
####    Reads files in SAS7BDAT or XPORT format used by SAS software and creates a DataFrame.
####    
####    read_pickle():
####    Reads a file in Python's pickle format and creates a DataFrame.
####    
####    read_hdf():
####    Reads a file in HDF5 (Hierarchical Data Format) and creates a DataFrame.
####    
####    read_sql_query():
####    Executes an SQL query and returns the result as a DataFrame.
####    
####    read_sql_table():
####    Reads a table from an SQL database and returns it as a DataFrame.
####    
####    read_gbq():
####    Reads data from Google BigQuery and creates a DataFrame.
####    
####    read_xml():
####    Reads a file in XML format and creates a DataFrame.
####    
####    read_spss():
####    Reads files in SAV format used by SPSS software and creates a DataFrame.

## "Missing Data" or "Incomplete Data"

In [55]:
s = pd.Series(["Erdem",np.nan,"Angela","Jack"])
s

0     Erdem
1       NaN
2    Angela
3      Jack
dtype: object

In [56]:
s.isnull()

0    False
1     True
2    False
3    False
dtype: bool

In [57]:
s.notnull()

0     True
1    False
2     True
3     True
dtype: bool

In [58]:
s[3] = None
s

0     Erdem
1       NaN
2    Angela
3      None
dtype: object

In [59]:
s.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [61]:
s.dropna()

0     Erdem
2    Angela
dtype: object

In [62]:
s[s.notnull()]

0     Erdem
2    Angela
dtype: object

In [63]:
from numpy import nan as NA

In [65]:
df = pd.DataFrame([[1,2,3],[4,NA,5],[NA,NA,NA]])
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [66]:
df.dropna()

     0    1    2
0  1.0  2.0  3.0

In [67]:
df.dropna(how= "all") # If the entire row is missing data, it removes that row.

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0

In [69]:
df[1]=NA
df.dropna(how= "all",axis = 1) # If the entire columns is missing data, it removes that row.

     0    2
0  1.0  3.0
1  4.0  5.0
2  NaN  NaN

In [70]:
df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [73]:
df.dropna(thresh=1) # Rows with at least 1 value are displayed.

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0

In [74]:
df.fillna(0) # assigns value to missing data

     0    1    2
0  1.0  0.0  3.0
1  4.0  0.0  5.0
2  0.0  0.0  0.0

In [75]:
df.fillna({0:15,
           1:25,
           2:35})

      0     1     2
0   1.0  25.0   3.0
1   4.0  25.0   5.0
2  15.0  25.0  35.0

In [76]:
df.fillna(0, inplace = True) # The Inplace command makes the change permanent.

In [77]:
df

     0    1    2
0  1.0  0.0  3.0
1  4.0  0.0  5.0
2  0.0  0.0  0.0

In [78]:
df = pd.DataFrame([[1,2,3],[4,NA,5],[NA,NA,NA]])
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [79]:
df.fillna(method="ffill") # Assigns missing data the value in the top row.

     0    1    2
0  1.0  2.0  3.0
1  4.0  2.0  5.0
2  4.0  2.0  5.0

In [80]:
df.fillna(method="ffill", limit=1)

     0    1    2
0  1.0  2.0  3.0
1  4.0  2.0  5.0
2  4.0  NaN  5.0

In [81]:
data = pd.Series([5,4,6,NA,9,2])
data

0    5.0
1    4.0
2    6.0
3    NaN
4    9.0
5    2.0
dtype: float64

In [82]:
data.fillna(data.mean())

0    5.0
1    4.0
2    6.0
3    5.2
4    9.0
5    2.0
dtype: float64

In [83]:
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [84]:
df.fillna(df.mean())

     0    1    2
0  1.0  2.0  3.0
1  4.0  2.0  5.0
2  2.5  2.0  4.0

## Data Cleaning

In [85]:
data = pd.DataFrame({"a":["one","two"]*3,
                     "b":[1,1,2,3,2,3]})
data

     a  b
0  one  1
1  two  1
2  one  2
3  two  3
4  one  2
5  two  3

In [89]:
data.duplicated() # Displays duplicate rows in boolean format.

0    False
1    False
2    False
3    False
4     True
5     True
dtype: bool

In [90]:
data.drop_duplicates()

     a  b
0  one  1
1  two  1
2  one  2
3  two  3

In [91]:
data["c"]= range(6)

In [92]:
data

     a  b  c
0  one  1  0
1  two  1  1
2  one  2  2
3  two  3  3
4  one  2  4
5  two  3  5

In [93]:
data.duplicated(["a"])

0    False
1    False
2     True
3     True
4     True
5     True
dtype: bool

In [94]:
data.duplicated(["c"])

0    False
1    False
2    False
3    False
4    False
5    False
dtype: bool

In [95]:
data.duplicated(["a","c"])

0    False
1    False
2    False
3    False
4    False
5    False
dtype: bool

In [98]:
data.duplicated(["a","b"], keep = "last") # Checking for duplicate values within a row.

0    False
1    False
2     True
3     True
4    False
5    False
dtype: bool

In [99]:
data1 = pd.DataFrame({"name":["erdem","jack","Angela","lucia","Joe"],
                     "points":[100,50,70,80,40]
                     }
                    )
data1

     name  points
0   erdem     100
1    jack      50
2  angela      70
3   lucia      80
4     joe      40

In [101]:
class_ = {"Erdem": "A",
          "Jack": "B",
          "Angela": "B",
          "Lucia": "A",
          "Joe": "C"}

names = data1["name"].str.capitalize()

In [102]:
data1["class"] = names.map(class_)

In [103]:
data1

     name  points class
0   erdem     100     A
1    jack      50     B
2  angela      70     B
3   lucia      80     A
4     joe      40     C

In [104]:
nt = pd.Series([80,70,90,60])
nt

0    80
1    70
2    90
3    60
dtype: int64

In [106]:
nt.replace(70,np.nan)

0    80.0
1     NaN
2    90.0
3    60.0
dtype: float64

In [110]:
nt.replace([60,70],[np.nan,0])

0    80.0
1     0.0
2    90.0
3     NaN
dtype: float64

In [111]:
nt.replace({90:100,
            60:0})

0     80
1     70
2    100
3      0
dtype: int64

In [112]:
df = pd.DataFrame(np.arange(12).reshape(3,4),
                  index = [0,1,2],
                  columns = ["erdem","angela","lucia","joe"])
df

   erdem  angela  lucia  joe
0      0       1      2    3
1      4       5      6    7
2      8       9     10   11

In [113]:
s = pd.Series(["one","two","three"])
df.index=df.index.map(s)
df

       erdem  angela  lucia  joe
one        0       1      2    3
two        4       5      6    7
three      8       9     10   11

In [114]:
df.rename(index = str.title, columns = str.upper)

       ERDEM  ANGELA  LUCIA  JOE
One        0       1      2    3
Two        4       5      6    7
Three      8       9     10   11

In [115]:
df.rename(index = {"one":"ten"}, columns = {"joe":"jack"})

       erdem  angela  lucia  jack
ten        0       1      2     3
two        4       5      6     7
three      8       9     10    11

In [116]:
df

       erdem  angela  lucia  joe
one        0       1      2    3
two        4       5      6    7
three      8       9     10   11

In [117]:
df.rename(index = {"one":"ten"}, 
          columns = {"joe":"jack"},
          inplace=True)
df

       erdem  angela  lucia  jack
ten        0       1      2     3
two        4       5      6     7
three      8       9     10    11